---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SweptBlendFailures.CannotDrawSweptblend
source: html/f6f45d0f-0c78-c3c9-0ad6-5e1aa06934ae.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SweptBlendFailures.CannotDrawSweptblend Property

Can't create swept blend.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawSweptblend { get; }
```